CPS-Projet/tests/html/tBloc.html
<?xml version="1.0" encoding="utf-8"?>

<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"

               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml"

lang="en" xml:lang="en">

<head>

<title>tBloc</title>

<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>

<meta name="generator" content="Org-mode"/>

<meta name="generated" content="2014-04-18 12:57:46 CEST"/>



<meta name="description" content=""/>

<meta name="keywords" content=""/>



</head>

<body>

<div id="content">



<h1 class="title">tBloc</h1>





<div id="table-of-contents">

<h2>Table of Contents</h2>

<div id="text-table-of-contents">

<ul>

<li><a href="#sec-1">1 Test Bloc </a>

<ul>

<li><a href="#sec-1.1">1.1 Cas de test 1.1 : Bloc::testInit </a>

<ul>

<li><a href="#sec-1.1.1">1.1.1 Condition initiale : ∅ </a></li>

<li><a href="#sec-1.1.2">1.1.2 Operation : L0 =(def) init(VIDE, RIEN) </a></li>

<li><a href="#sec-1.1.3">1.1.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.2">1.2 Cas de test 1.2 : Bloc::testInit2 </a>

<ul>

<li><a href="#sec-1.2.1">1.2.1 Condition initiale : ∅ </a></li>

<li><a href="#sec-1.2.2">1.2.2 Operation : L0 =(def) init(VIDE, DIXDOLLAR) </a></li>

<li><a href="#sec-1.2.3">1.2.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.3">1.3 Cas de test 2.1 : Bloc::testRamasserTresor </a>

<ul>

<li><a href="#sec-1.3.1">1.3.1 Condition initiale : L =(def) init(VIDE, DIXDOLLAR) </a></li>

<li><a href="#sec-1.3.2">1.3.2 Operation : L0 =(def) ramasserTresor(L) </a></li>

<li><a href="#sec-1.3.3">1.3.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.4">1.4 Cas de test 2.2 : Bloc::testRamasserTresorFail </a>

<ul>

<li><a href="#sec-1.4.1">1.4.1 Condition initiale : L =(def) init(VIDE, RIEN) </a></li>

<li><a href="#sec-1.4.2">1.4.2 Operation : L0 =(def) ramasserTresor(L) </a></li>

<li><a href="#sec-1.4.3">1.4.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.5">1.5 Cas de test 3.1 : Bloc::testDeposerTresor </a>

<ul>

<li><a href="#sec-1.5.1">1.5.1 Condition initiale : L =(def) init(VIDE, RIEN) </a></li>

<li><a href="#sec-1.5.2">1.5.2 Operation : L0 =(def) deposerTresor(L, CHAINEVELO) </a></li>

<li><a href="#sec-1.5.3">1.5.3 Oracle : </a></li>

</ul>

</li>

<li><a href="#sec-1.6">1.6 Cas de test 3.2 : Bloc::testDeposerTresorFail </a>

<ul>

<li><a href="#sec-1.6.1">1.6.1 Condition initiale : L =(def) init(VIDE, DIXDOLLAR) </a></li>

<li><a href="#sec-1.6.2">1.6.2 Operation : L0 =(def) deposerTresor(L, CHAINEVELO) </a></li>

<li><a href="#sec-1.6.3">1.6.3 Oracle : </a></li>

</ul>

</li>

</ul>

</li>

</ul>

</div>

</div>



<div id="outline-container-1" class="outline-2">

<h2 id="sec-1"><span class="section-number-2">1</span> Test Bloc </h2>

<div class="outline-text-2" id="text-1">







</div>



<div id="outline-container-1.1" class="outline-3">

<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Cas de test 1.1 : Bloc::testInit </h3>

<div class="outline-text-3" id="text-1.1">





</div>



<div id="outline-container-1.1.1" class="outline-4">

<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> Condition initiale : ∅ </h4>

<div class="outline-text-4" id="text-1.1.1">



</div>



</div>



<div id="outline-container-1.1.2" class="outline-4">

<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> Operation : L0 =(def) init(VIDE, RIEN) </h4>

<div class="outline-text-4" id="text-1.1.2">



</div>



</div>



<div id="outline-container-1.1.3" class="outline-4">

<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.1.3">



<ul>

<li id="sec-1.1.3.1">aTresor(L0) = false <br/>

</li>

<li id="sec-1.1.3.2">typeBloc(L0) = VIDE <br/>





</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.2" class="outline-3">

<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Cas de test 1.2 : Bloc::testInit2 </h3>

<div class="outline-text-3" id="text-1.2">





</div>



<div id="outline-container-1.2.1" class="outline-4">

<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> Condition initiale : ∅ </h4>

<div class="outline-text-4" id="text-1.2.1">



</div>



</div>



<div id="outline-container-1.2.2" class="outline-4">

<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> Operation : L0 =(def) init(VIDE, DIXDOLLAR) </h4>

<div class="outline-text-4" id="text-1.2.2">



</div>



</div>



<div id="outline-container-1.2.3" class="outline-4">

<h4 id="sec-1.2.3"><span class="section-number-4">1.2.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.2.3">



<ul>

<li id="sec-1.2.3.1">aTresor(L0) = true <br/>

</li>

<li id="sec-1.2.3.2">typeTresor(L0) = DIXDOLLAR <br/>

</li>

<li id="sec-1.2.3.3">typeBloc(L0) = VIDE <br/>









</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.3" class="outline-3">

<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Cas de test 2.1 : Bloc::testRamasserTresor </h3>

<div class="outline-text-3" id="text-1.3">





</div>



<div id="outline-container-1.3.1" class="outline-4">

<h4 id="sec-1.3.1"><span class="section-number-4">1.3.1</span> Condition initiale : L =(def) init(VIDE, DIXDOLLAR) </h4>

<div class="outline-text-4" id="text-1.3.1">



</div>



</div>



<div id="outline-container-1.3.2" class="outline-4">

<h4 id="sec-1.3.2"><span class="section-number-4">1.3.2</span> Operation : L0 =(def) ramasserTresor(L) </h4>

<div class="outline-text-4" id="text-1.3.2">



</div>



</div>



<div id="outline-container-1.3.3" class="outline-4">

<h4 id="sec-1.3.3"><span class="section-number-4">1.3.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.3.3">



<ul>

<li id="sec-1.3.3.1">aTresor(L0) = false <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.4" class="outline-3">

<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Cas de test 2.2 : Bloc::testRamasserTresorFail </h3>

<div class="outline-text-3" id="text-1.4">





</div>



<div id="outline-container-1.4.1" class="outline-4">

<h4 id="sec-1.4.1"><span class="section-number-4">1.4.1</span> Condition initiale : L =(def) init(VIDE, RIEN) </h4>

<div class="outline-text-4" id="text-1.4.1">



</div>



</div>



<div id="outline-container-1.4.2" class="outline-4">

<h4 id="sec-1.4.2"><span class="section-number-4">1.4.2</span> Operation : L0 =(def) ramasserTresor(L) </h4>

<div class="outline-text-4" id="text-1.4.2">



</div>



</div>



<div id="outline-container-1.4.3" class="outline-4">

<h4 id="sec-1.4.3"><span class="section-number-4">1.4.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.4.3">



<ul>

<li id="sec-1.4.3.1">aTresor(L) = false <br/>

</li>

<li id="sec-1.4.3.2">#exception levee <br/>









</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.5" class="outline-3">

<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Cas de test 3.1 : Bloc::testDeposerTresor </h3>

<div class="outline-text-3" id="text-1.5">





</div>



<div id="outline-container-1.5.1" class="outline-4">

<h4 id="sec-1.5.1"><span class="section-number-4">1.5.1</span> Condition initiale : L =(def) init(VIDE, RIEN) </h4>

<div class="outline-text-4" id="text-1.5.1">



</div>



</div>



<div id="outline-container-1.5.2" class="outline-4">

<h4 id="sec-1.5.2"><span class="section-number-4">1.5.2</span> Operation : L0 =(def) deposerTresor(L, CHAINEVELO) </h4>

<div class="outline-text-4" id="text-1.5.2">



</div>



</div>



<div id="outline-container-1.5.3" class="outline-4">

<h4 id="sec-1.5.3"><span class="section-number-4">1.5.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.5.3">



<ul>

<li id="sec-1.5.3.1">aTresor(L0) = true <br/>

</li>

<li id="sec-1.5.3.2">typeTresor(L0) = CHAINEVELO <br/>



</li>

</ul>

</div>

</div>



</div>



<div id="outline-container-1.6" class="outline-3">

<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Cas de test 3.2 : Bloc::testDeposerTresorFail </h3>

<div class="outline-text-3" id="text-1.6">





</div>



<div id="outline-container-1.6.1" class="outline-4">

<h4 id="sec-1.6.1"><span class="section-number-4">1.6.1</span> Condition initiale : L =(def) init(VIDE, DIXDOLLAR) </h4>

<div class="outline-text-4" id="text-1.6.1">



</div>



</div>



<div id="outline-container-1.6.2" class="outline-4">

<h4 id="sec-1.6.2"><span class="section-number-4">1.6.2</span> Operation : L0 =(def) deposerTresor(L, CHAINEVELO) </h4>

<div class="outline-text-4" id="text-1.6.2">



</div>



</div>



<div id="outline-container-1.6.3" class="outline-4">

<h4 id="sec-1.6.3"><span class="section-number-4">1.6.3</span> Oracle : </h4>

<div class="outline-text-4" id="text-1.6.3">



<ul>

<li id="sec-1.6.3.1">aTresor(L) = true <br/>

</li>

<li id="sec-1.6.3.2">#exception levee <br/>

</li>

</ul>

</div>

</div>

</div>

</div>

<div id="postamble">

<p class="author"> Authors: Kevin Coquart, Quentin Bunel



</p>

<p class="date"> Date: 2014-04-18 12:57:46 CEST</p>

<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>

</div>

</div>

</body>

</html>

